            05       INF-CODE               PIC X(2).
            05       INF-VALEUR             PIC 9(3)V9(6).
            05       INF-LIBELLE            PIC X(50).
            05       INF-DATE               PIC X(10).
 
 
